; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star11 - direction
	Star12 - direction
	GroundStation14 - direction
	GroundStation15 - direction
	GroundStation18 - direction
	GroundStation20 - direction
	GroundStation21 - direction
	GroundStation27 - direction
	Star19 - direction
	Star26 - direction
	Star5 - direction
	Star10 - direction
	Star4 - direction
	GroundStation24 - direction
	GroundStation17 - direction
	GroundStation23 - direction
	GroundStation13 - direction
	Star22 - direction
	Star8 - direction
	GroundStation7 - direction
	Star9 - direction
	Star29 - direction
	GroundStation25 - direction
	GroundStation28 - direction
	GroundStation16 - direction
	Star30 - direction
	Star31 - direction
	Star32 - direction
	Planet33 - direction
	Planet34 - direction
	Star35 - direction
	Planet36 - direction
	Star37 - direction
	Planet38 - direction
	Star39 - direction
	Phenomenon40 - direction
	Planet41 - direction
	Phenomenon42 - direction
	Phenomenon43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Star46 - direction
	Planet47 - direction
	Planet48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation28)
	(calibration_target instrument0 Star26)
	(calibration_target instrument0 Star19)
	(calibration_target instrument0 GroundStation17)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star32)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star22)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation23)
	(calibration_target instrument1 GroundStation17)
	(calibration_target instrument1 GroundStation24)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star32)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation16)
	(calibration_target instrument2 GroundStation28)
	(calibration_target instrument2 GroundStation25)
	(calibration_target instrument2 Star29)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star39)
)
(:goal (and
	(pointing satellite1 Phenomenon43)
	(pointing satellite2 GroundStation7)
	(have_image Star30 spectrograph1)
	(have_image Star31 infrared3)
	(have_image Star32 spectrograph1)
	(have_image Planet33 spectrograph1)
	(have_image Planet34 spectrograph0)
	(have_image Star35 infrared3)
	(have_image Planet36 infrared3)
	(have_image Star37 spectrograph2)
	(have_image Planet38 spectrograph2)
	(have_image Star39 spectrograph1)
	(have_image Phenomenon40 spectrograph0)
	(have_image Planet41 spectrograph0)
	(have_image Phenomenon42 spectrograph2)
	(have_image Phenomenon43 infrared3)
	(have_image Planet44 spectrograph2)
	(have_image Phenomenon45 spectrograph1)
	(have_image Star46 spectrograph1)
	(have_image Planet47 spectrograph2)
	(have_image Planet48 spectrograph1)
	(have_image Phenomenon49 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 22
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 22
3. (turn_to satellite2 groundstation7 star39)
   deleted: (pointing satellite2 star39)
   added: (pointing satellite2 groundstation7)
   goals met: 1 of 22
4. (calibrate satellite2 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 1 of 22
5. (turn_to satellite1 phenomenon43 star32)
   deleted: (pointing satellite1 star32)
   added: (pointing satellite1 phenomenon43)
   goals met: 2 of 22
6. (turn_to satellite0 phenomenon42 star32)
   deleted: (pointing satellite0 star32)
   added: (pointing satellite0 phenomenon42)
   goals met: 2 of 22
7. (turn_to satellite2 phenomenon40 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon40)
   goals met: 1 of 22
8. (take_image satellite2 phenomenon40 instrument2 spectrograph0)
   added: (have_image phenomenon40 spectrograph0)
   goals met: 2 of 22
9. (turn_to satellite2 groundstation7 phenomenon40)
   deleted: (pointing satellite2 phenomenon40)
   added: (pointing satellite2 groundstation7)
   goals met: 3 of 22
10. (turn_to satellite2 phenomenon43 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon43)
   goals met: 2 of 22
11. (take_image satellite2 phenomenon43 instrument2 infrared3)
   added: (have_image phenomenon43 infrared3)
   goals met: 3 of 22
12. (turn_to satellite2 groundstation7 phenomenon43)
   deleted: (pointing satellite2 phenomenon43)
   added: (pointing satellite2 groundstation7)
   goals met: 4 of 22
13. (turn_to satellite2 phenomenon45 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon45)
   goals met: 3 of 22
14. (take_image satellite2 phenomenon45 instrument2 spectrograph1)
   added: (have_image phenomenon45 spectrograph1)
   goals met: 4 of 22
15. (turn_to satellite2 groundstation7 phenomenon45)
   deleted: (pointing satellite2 phenomenon45)
   added: (pointing satellite2 groundstation7)
   goals met: 5 of 22
16. (turn_to satellite2 phenomenon49 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon49)
   goals met: 4 of 22
17. (take_image satellite2 phenomenon49 instrument2 spectrograph0)
   added: (have_image phenomenon49 spectrograph0)
   goals met: 5 of 22
18. (turn_to satellite2 groundstation7 phenomenon49)
   deleted: (pointing satellite2 phenomenon49)
   added: (pointing satellite2 groundstation7)
   goals met: 6 of 22
19. (turn_to satellite2 planet33 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet33)
   goals met: 5 of 22
20. (take_image satellite2 planet33 instrument2 spectrograph1)
   added: (have_image planet33 spectrograph1)
   goals met: 6 of 22
21. (turn_to satellite2 groundstation7 planet33)
   deleted: (pointing satellite2 planet33)
   added: (pointing satellite2 groundstation7)
   goals met: 7 of 22
22. (turn_to satellite2 planet34 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet34)
   goals met: 6 of 22
23. (take_image satellite2 planet34 instrument2 spectrograph0)
   added: (have_image planet34 spectrograph0)
   goals met: 7 of 22
24. (turn_to satellite2 groundstation7 planet34)
   deleted: (pointing satellite2 planet34)
   added: (pointing satellite2 groundstation7)
   goals met: 8 of 22
25. (turn_to satellite2 planet36 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet36)
   goals met: 7 of 22
26. (take_image satellite2 planet36 instrument2 infrared3)
   added: (have_image planet36 infrared3)
   goals met: 8 of 22
27. (turn_to satellite2 groundstation7 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 groundstation7)
   goals met: 9 of 22
28. (turn_to satellite2 planet41 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet41)
   goals met: 8 of 22
29. (take_image satellite2 planet41 instrument2 spectrograph0)
   added: (have_image planet41 spectrograph0)
   goals met: 9 of 22
30. (turn_to satellite2 groundstation7 planet41)
   deleted: (pointing satellite2 planet41)
   added: (pointing satellite2 groundstation7)
   goals met: 10 of 22
31. (turn_to satellite2 planet48 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet48)
   goals met: 9 of 22
32. (take_image satellite2 planet48 instrument2 spectrograph1)
   added: (have_image planet48 spectrograph1)
   goals met: 10 of 22
33. (turn_to satellite2 groundstation7 planet48)
   deleted: (pointing satellite2 planet48)
   added: (pointing satellite2 groundstation7)
   goals met: 11 of 22
34. (turn_to satellite2 star30 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star30)
   goals met: 10 of 22
35. (take_image satellite2 star30 instrument2 spectrograph1)
   added: (have_image star30 spectrograph1)
   goals met: 11 of 22
36. (turn_to satellite2 groundstation7 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 groundstation7)
   goals met: 12 of 22
37. (turn_to satellite2 star31 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star31)
   goals met: 11 of 22
38. (take_image satellite2 star31 instrument2 infrared3)
   added: (have_image star31 infrared3)
   goals met: 12 of 22
39. (turn_to satellite2 groundstation7 star31)
   deleted: (pointing satellite2 star31)
   added: (pointing satellite2 groundstation7)
   goals met: 13 of 22
40. (turn_to satellite2 star32 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star32)
   goals met: 12 of 22
41. (take_image satellite2 star32 instrument2 spectrograph1)
   added: (have_image star32 spectrograph1)
   goals met: 13 of 22
42. (turn_to satellite2 groundstation7 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 groundstation7)
   goals met: 14 of 22
43. (turn_to satellite2 star35 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star35)
   goals met: 13 of 22
44. (take_image satellite2 star35 instrument2 infrared3)
   added: (have_image star35 infrared3)
   goals met: 14 of 22
45. (turn_to satellite2 groundstation7 star35)
   deleted: (pointing satellite2 star35)
   added: (pointing satellite2 groundstation7)
   goals met: 15 of 22
46. (turn_to satellite2 star39 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star39)
   goals met: 14 of 22
47. (take_image satellite2 star39 instrument2 spectrograph1)
   added: (have_image star39 spectrograph1)
   goals met: 15 of 22
48. (turn_to satellite2 groundstation7 star39)
   deleted: (pointing satellite2 star39)
   added: (pointing satellite2 groundstation7)
   goals met: 16 of 22
49. (turn_to satellite2 star46 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star46)
   goals met: 15 of 22
50. (take_image satellite2 star46 instrument2 spectrograph1)
   added: (have_image star46 spectrograph1)
   goals met: 16 of 22
51. (turn_to satellite2 groundstation7 star46)
   deleted: (pointing satellite2 star46)
   added: (pointing satellite2 groundstation7)
   goals met: 17 of 22
52. (turn_to satellite0 star9 phenomenon42)
   deleted: (pointing satellite0 phenomenon42)
   added: (pointing satellite0 star9)
   goals met: 17 of 22
53. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 17 of 22
54. (turn_to satellite0 phenomenon42 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon42)
   goals met: 17 of 22
55. (take_image satellite0 phenomenon42 instrument0 spectrograph2)
   added: (have_image phenomenon42 spectrograph2)
   goals met: 18 of 22
56. (turn_to satellite0 planet38 phenomenon42)
   deleted: (pointing satellite0 phenomenon42)
   added: (pointing satellite0 planet38)
   goals met: 18 of 22
57. (take_image satellite0 planet38 instrument0 spectrograph2)
   added: (have_image planet38 spectrograph2)
   goals met: 19 of 22
58. (turn_to satellite0 planet44 planet38)
   deleted: (pointing satellite0 planet38)
   added: (pointing satellite0 planet44)
   goals met: 19 of 22
59. (take_image satellite0 planet44 instrument0 spectrograph2)
   added: (have_image planet44 spectrograph2)
   goals met: 20 of 22
60. (turn_to satellite0 planet47 planet44)
   deleted: (pointing satellite0 planet44)
   added: (pointing satellite0 planet47)
   goals met: 20 of 22
61. (take_image satellite0 planet47 instrument0 spectrograph2)
   added: (have_image planet47 spectrograph2)
   goals met: 21 of 22
62. (turn_to satellite0 star37 planet47)
   deleted: (pointing satellite0 planet47)
   added: (pointing satellite0 star37)
   goals met: 21 of 22
63. (take_image satellite0 star37 instrument0 spectrograph2)
   added: (have_image star37 spectrograph2)
   goals met: 22 of 22
